// LETS IMAGINE THAT THIS DATA IS IN THE DATABASE

import { T_navRoute, T_products, T_sliderItem } from "./types";

export const navRoutesData: T_navRoute[] = [
	{
		id: 1,
		title: "Мои заказы",
		href: "#",
	},
	{
		id: 2,
		title: "Сотрудники",
		href: "#",
	},
	{
		id: 3,
		title: "Шаблоны заказов",
		href: "#",
	},
	{
		id: 4,
		title: "Обращения",
		href: "#",
	},
];

export const sliderData: T_sliderItem[] = [
	{
		id: 1,
		title: "Skechers Sunny Dale",
		url: "/images/sneaker_1.webp",
		price: 7599,
		count: 0,
		availableCount: 7,
		characteristics: [
			{
				title: "Код поставщика",
				value: "ELC00696",
			},
			{
				title: "Артикул",
				value: "ELC0200000696",
			},
			{
				title: "Код РАЭК",
				value: "ELC00696",
			},
			{
				title: "Код ETM",
				value: "ELC00696",
			},
			{
				title: "Бренд",
				value: "Electric used",
			},
			{
				title: "Серия",
				value: "ELC00696",
			},
			{
				title: "Код производителя",
				value: "ELC0200000696",
			},
		],
		description:
			"Создание приверженного покупателя специфицирует неопровержимый комплексный анализ ситуации. CTR существенно индуцирует из ряда вон выходящий SWOT-анализ. Воздействие на потребителя определяет возрастающий интеграл по поверхности, что известно даже школьникам. Отсюда естественно следует, что коммуникация уравновешивает косвенный фактор коммуникации. Поле направлений естественно допускает экспериментальный скачок функции, таким образом сбылась мечта идиота - утверждение полностью доказано. Арифметическая прогрессия притягивает линейно зависимый пул лояльных изданий.",
	},
	{
		id: 2,
		title: "Skechers Blue",
		url: "/images/sneaker_2.webp",
		price: 6500,
		count: 0,
		availableCount: 6,
		characteristics: [
			{
				title: "Код поставщика",
				value: "ELC00595",
			},
			{
				title: "Артикул",
				value: "ELC0200000595",
			},
			{
				title: "Код РАЭК",
				value: "ELC00595",
			},
			{
				title: "Код ETM",
				value: "ELC00595",
			},
			{
				title: "Бренд",
				value: "Electric used",
			},
			{
				title: "Серия",
				value: "ELC00595",
			},
			{
				title: "Код производителя",
				value: "ELC0200000595",
			},
		],
		description:
			"2. Создание приверженного покупателя специфицирует неопровержимый комплексный анализ ситуации. CTR существенно индуцирует из ряда вон выходящий SWOT-анализ. Воздействие на потребителя определяет возрастающий интеграл по поверхности, что известно даже школьникам. Отсюда естественно следует, что коммуникация уравновешивает косвенный фактор коммуникации. Поле направлений естественно допускает экспериментальный скачок функции, таким образом сбылась мечта идиота - утверждение полностью доказано. Арифметическая прогрессия притягивает линейно зависимый пул лояльных изданий.",
	},
	{
		id: 3,
		title: "Skechers Light",
		url: "/images/sneaker_3.webp",
		price: 7099,
		count: 0,
		availableCount: 9,
		characteristics: [
			{
				title: "Код поставщика",
				value: "ELC00701",
			},
			{
				title: "Артикул",
				value: "ELC0200000701",
			},
			{
				title: "Код РАЭК",
				value: "ELC00701",
			},
			{
				title: "Код ETM",
				value: "ELC00701",
			},
			{
				title: "Бренд",
				value: "Electric used",
			},
			{
				title: "Серия",
				value: "ELC00701",
			},
			{
				title: "Код производителя",
				value: "ELC0200000701",
			},
		],
		description:
			"3. Создание приверженного покупателя специфицирует неопровержимый комплексный анализ ситуации. CTR существенно индуцирует из ряда вон выходящий SWOT-анализ. Воздействие на потребителя определяет возрастающий интеграл по поверхности, что известно даже школьникам. Отсюда естественно следует, что коммуникация уравновешивает косвенный фактор коммуникации. Поле направлений естественно допускает экспериментальный скачок функции, таким образом сбылась мечта идиота - утверждение полностью доказано. Арифметическая прогрессия притягивает линейно зависимый пул лояльных изданий.",
	},
	{
		id: 4,
		title: "Skechers Dark",
		url: "/images/sneaker_4.webp",
		price: 6599,
		count: 0,
		availableCount: 5,
		characteristics: [
			{
				title: "Код поставщика",
				value: "ELC00690",
			},
			{
				title: "Артикул",
				value: "ELC0200000690",
			},
			{
				title: "Код РАЭК",
				value: "ELC00690",
			},
			{
				title: "Код ETM",
				value: "ELC00690",
			},
			{
				title: "Бренд",
				value: "Electric used",
			},
			{
				title: "Серия",
				value: "ELC00690",
			},
			{
				title: "Код производителя",
				value: "ELC0200000690",
			},
		],
		description:
			"4. Создание приверженного покупателя специфицирует неопровержимый комплексный анализ ситуации. CTR существенно индуцирует из ряда вон выходящий SWOT-анализ. Воздействие на потребителя определяет возрастающий интеграл по поверхности, что известно даже школьникам. Отсюда естественно следует, что коммуникация уравновешивает косвенный фактор коммуникации. Поле направлений естественно допускает экспериментальный скачок функции, таким образом сбылась мечта идиота - утверждение полностью доказано. Арифметическая прогрессия притягивает линейно зависимый пул лояльных изданий.",
	},
	{
		id: 5,
		title: "Skechers Brown",
		url: "/images/sneaker_5.webp",
		price: 6800,
		count: 0,
		availableCount: 4,
		characteristics: [
			{
				title: "Код поставщика",
				value: "ELC00969",
			},
			{
				title: "Артикул",
				value: "ELC0200000969",
			},
			{
				title: "Код РАЭК",
				value: "ELC00969",
			},
			{
				title: "Код ETM",
				value: "ELC00969",
			},
			{
				title: "Бренд",
				value: "Electric used",
			},
			{
				title: "Серия",
				value: "ELC00969",
			},
			{
				title: "Код производителя",
				value: "ELC0200000969",
			},
		],
		description:
			"5. Создание приверженного покупателя специфицирует неопровержимый комплексный анализ ситуации. CTR существенно индуцирует из ряда вон выходящий SWOT-анализ. Воздействие на потребителя определяет возрастающий интеграл по поверхности, что известно даже школьникам. Отсюда естественно следует, что коммуникация уравновешивает косвенный фактор коммуникации. Поле направлений естественно допускает экспериментальный скачок функции, таким образом сбылась мечта идиота - утверждение полностью доказано. Арифметическая прогрессия притягивает линейно зависимый пул лояльных изданий.",
	},
];

export const femaleProductsData: T_products = {
	title: "Женщинам",
	categories: [
		{
			id: 1,
			title: "Одежда",
		},
		{
			id: 2,
			title: "Обувь",
		},
		{
			id: 3,
			title: "Аксессуары",
		},
		{
			id: 4,
			title: "Белье",
		},
		{
			id: 5,
			title: "Bra fitting",
		},
	],
};

export const maleProductsData: T_products = {
	title: "Мужчинам",
	categories: [
		{
			id: 1,
			title: "Одежда",
		},
		{
			id: 2,
			title: "Обувь",
		},
		{
			id: 3,
			title: "Аксессуары",
		},
		{
			id: 4,
			title: "Белье",
		},
	],
};

export const childrenProductsData: T_products = {
	title: "Детям",
	categories: [
		{
			id: 1,
			title: "Одежда",
		},
		{
			id: 2,
			title: "Обувь",
		},
		{
			id: 3,
			title: "Аксессуары",
		},
		{
			id: 4,
			title: "Белье",
		},
		{
			id: 5,
			title: "Игрушки",
		},
		{
			id: 6,
			title: "Малыши",
		},
	],
};

export const sportProductsData: T_products = {
	title: "Виды спорта",
	categories: [
		{
			id: 1,
			title: "Велоспорт",
		},
		{
			id: 2,
			title: "Туризм",
		},
		{
			id: 3,
			title: "Тренажеры и фитнес",
		},
		{
			id: 4,
			title: "Командные виды спорта",
		},
		{
			id: 5,
			title: "Самокаты",
		},
	],
};
